let i = 0
const L = 15
// Получаем значение из командной строки
const N = process.argv[2]
let max = 0
let maxS = ''

// Числа от 0 до 31 в двоичной записи
const S = [
  '000000000000000',
  '000000000000001',
  '000000000000010',
  '000000000000011',
  '000000000000100',
  '000000000000101',
  '000000000000110',
  '000000000000111',
  '000000000001000',
  '000000000001001',
  '000000000001010',
  '000000000001011',
  '000000000001100',
  '000000000001101',
  '000000000001110',
  '000000000001111',
  '000000000010000',
  '000000000010001',
  '000000000010010',
  '000000000010011',
  '000000000010100',
  '000000000010101',
  '000000000010110',
  '000000000010111',
  '000000000011000',
  '000000000011001',
  '000000000011010',
  '000000000011011',
  '000000000011100',
  '000000000011101',
  '000000000011110',
  '000000000011111',
]

// Соответствующие кодировкам десятичные числа
const u = [
  0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26,
  27, 28, 29, 30, 31,
]

while (i < N) {
  console.log(`Номер шага: ${i}`)
  console.log(`Текущий максимум приспособленности: ${max}`)
  console.log(`Текущая лучшая кодировка: ${maxS}`)

  // Math.random() генерирует число в диапазоне [0,1), а Math.floor() округляет в меньшую сторону
  const choice = Math.floor(Math.random() * 32)

  console.log(`Выбранная кодировка: ${S[choice]}`)
  console.log(`Приспособленность выбранной кодировки: ${u[choice]}`)

  if (max < u[choice]) {
    max = u[choice]
    maxS = S[choice]
    console.log(`Максимальная кодировка теперь ${maxS}`)
    console.log(`Максимальная приспособленность теперь ${max}`)
  } else {
    console.log(`Максимальные приспособленность и кодировка не изменились`)
  }

  console.log('------------')
  i++
}

console.log(`Решение`)
console.log(`Кодировка: ${maxS}`)
console.log(`Приспособленность: ${max}`)
